In [2]:
import pandas as pd
titanic_train = pd.read_csv("train.csv")
titanic_train.head(6)

,survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q

In [29]:
type = titanic_train.dtypes[titanic_train.dtypes=="object"]
#type = titanic_train.dtypes=="object"
type

name        object
sex         object
ticket      object
cabin       object
embarked    object
dtype: object

In [3]:
titanic_train["embarked"].describe()

count     889
unique      3
top         S
freq      644
Name: embarked, dtype: object

In [4]:
titanic_train["embarked"].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [5]:
embarked = titanic_train["embarked"]
list_embarked = pd.Categorical(embarked)
list_embarked.describe()

            counts     freqs
categories
C              168  0.188552
Q               77  0.086420
S              644  0.722783
NaN              2  0.002245

In [6]:
dead_survived = pd.Categorical(titanic_train["survived"])
dead_survived = dead_survived.rename_categories(["Dead","Survived"])
dead_survived.describe() #xem thống kê cơ bản như trung bình, phân vị, std,....

            counts     freqs
categories
Dead           549  0.616162
Survived       342  0.383838

In [7]:
titanic_train["survived"].unique() #giá trị duy nhất của cột survived

array([0, 1], dtype=int64)

In [17]:
import numpy as np
#Các dữ liệu dạng phân loại thường được biểu diễn dưới dạng text.
alphabet = titanic_train["cabin"].astype(str)
first_alphabet = np.array([cabin[0] for cabin in alphabet])
first_alphabet = pd.Categorical(first_alphabet)
first_alphabet.describe()

            counts     freqs
categories
A               15  0.016835
B               47  0.052750
C               59  0.066218
D               33  0.037037
E               32  0.035915
F               13  0.014590
G                4  0.004489
T                1  0.001122
n              687  0.771044

In [37]:
print(titanic_train["cabin"][0:15])
print(titanic_train["name"].describe())

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: cabin, dtype: object
count                         891
unique                        891
top       Braund, Mr. Owen Harris
freq                            1
Name: name, dtype: object